In [5]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np
from lxml import objectify

In [15]:
!type examples/ex1.csv
a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

The syntax of the command is incorrect.

NameError: name 'a' is not defined

In [16]:
df = pd.read_csv('g:\examples\ex1.csv')

In [17]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
pd.read_table('g:\examples\ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [19]:
df = pd.read_csv('g:\examples\ex2.csv', header=None)

In [20]:
df

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [21]:
pd.read_csv('g:\examples\ex2.csv', names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [22]:
names = ['a','b','c','d','message']

In [23]:
pd.read_csv('g:\examples\ex2.csv', names=names, index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [24]:
parsed = pd.read_csv('g:\examples\ex3.csv', index_col= ['key1','key2'])

In [25]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
ome  c          5       6
one  d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [27]:
pd.read_csv('g:\examples\ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [28]:
result = pd.read_csv('g:\examples\ex5.csv')

In [29]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [30]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [31]:
result = pd.read_csv('g:\examples\ex5.csv', na_values= ['NULL'])

In [32]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [1]:
sentinels = {'message': ['foo','NA'], 'something': ['two']}

In [4]:
pd.read_csv('g:\examples\ex5.csv', na_values= sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [5]:
# Reading Text Files into Pieces.

In [8]:
pd.options.display.max_rows = 10

In [9]:
result = pd.read_csv('G:\Data_Analysis\pydata-book-2nd-edition\examples\ex6.csv')

In [10]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [11]:
pd.read_csv('G:\Data_Analysis\pydata-book-2nd-edition\examples\ex6.csv', nrows = 5) # to read small no of rows.

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [12]:
# to read file in piecces we have to specify the chunksize as the no of rows.(chunksize = no of rows)

In [13]:
chunker = pd.read_csv('G:\Data_Analysis\pydata-book-2nd-edition\examples\ex6.csv', chunksize = 1000)

In [14]:
chunker

In [15]:
# by iterating  it we can get the data

In [16]:
tot = pd.Series([])

In [18]:
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value = 0)

In [19]:
tot = tot.sort_values(ascending = False)

In [20]:
tot

E    336.0
X    327.0
L    315.0
M    309.0
K    303.0
     ...
3    147.0
0    142.0
2    141.0
9    139.0
1    133.0
Length: 36, dtype: float64

In [21]:
tot[:10]

E    336.0
X    327.0
L    315.0
M    309.0
K    303.0
Q    301.0
O    299.0
P    299.0
J    298.0
F    295.0
dtype: float64

In [22]:
# Writing Data to a Text Format.

In [2]:
data = pd.read_csv('G:\Data_Analysis\pydata-book-2nd-edition\examples\ex5.csv')

In [3]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [4]:
# we can write the data out to a comma seperated file, using "to_csv" method.

In [7]:
data.to_csv('G:\Data_Analysis\pydata-book-2nd-edition\examples\out.csv')

NameError: name 'data' is not defined

In [8]:
!type G:\Data_Analysis\pydata-book-2nd-edition\examples\out.csv
,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,8,world
2,three,9,10,11.0,12,foo

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

NameError: name 'something' is not defined

In [9]:
import sys

In [10]:
data.to_csv(sys.stdout, sep='|')
|something|a|b|c|d|message
0|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

SyntaxError: invalid syntax (<ipython-input-10-a349ee3c4084>, line 2)

In [1]:
# Working with Delimited Formats.

In [12]:
!cat examples/ex7.csv
"a","b","c"
"1","2","3"
"1","2","3"

'cat' is not recognized as an internal or external command,
operable program or batch file.

('1', '2', '3')

In [13]:
import csv

In [15]:
f = open('G:\Data_Analysis\pydata-book-2nd-edition\examples\ex7.csv')
reader = csv.reader(f)
reader

In [16]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [18]:
with open('G:\Data_Analysis\pydata-book-2nd-edition\examples\ex7.csv') as f:
    lines = list(csv.reader(f))

In [19]:
header, values = lines[0],lines[1:]

In [21]:
data_dict = {h: v for h,v in zip(header, zip(*values))}

In [22]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [23]:
# JSON DATA (java script object notation).

In [8]:
obj = """
{"name":"wes",
"places_lived":["united state","italy","spain"],
"pet": "null",
"siblings":[{"name":"scott","age":30,"pets":["zukes","tony"]},
{"name":"katie","age":25,"pets":["sico","pixo","locu"]}]
}
"""

In [6]:
import json

In [9]:
result = json.loads(obj)

In [10]:
result

{'name': 'wes',
 'places_lived': ['united state', 'italy', 'spain'],
 'pet': 'null',
 'siblings': [{'name': 'scott', 'age': 30, 'pets': ['zukes', 'tony']},
  {'name': 'katie', 'age': 25, 'pets': ['sico', 'pixo', 'locu']}]}

In [11]:
asjson = json.dumps(result)

In [12]:
asjson

'{"name": "wes", "places_lived": ["united state", "italy", "spain"], "pet": "null", "siblings": [{"name": "scott", "age": 30, "pets": ["zukes", "tony"]}, {"name": "katie", "age": 25, "pets": ["sico", "pixo", "locu"]}]}'

In [19]:
siblings = pd.DataFrame(result['places_lived'],columns = ['country'])

In [20]:
siblings

        country
0  united state
1         italy
2         spain

In [21]:
!cat examples/example.json
[{"a":1,"b":2,"c":3},
{"a":4,"b":5,"c":6},
{"a":7,"b":8,"c":9}]

'cat' is not recognized as an internal or external command,
operable program or batch file.

[{'a': 1, 'b': 2, 'c': 3}, {'a': 4, 'b': 5, 'c': 6}, {'a': 7, 'b': 8, 'c': 9}]

In [22]:
data = pd.read_json('G:\Data_Analysis\pydata-book-2nd-edition\examples\example.json')

In [23]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [25]:
# to export data from PANDA to JSON :-

In [26]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [29]:
print(data.to_json(orient = 'records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [30]:
# XML and HTML : WEB SCRAPING :-

In [19]:
tables = pd.read_html('file:///G:/Data_Analysis/pydata-book-2nd-edition/examples/fdic_failed_bank_list.html') # read html uses libraries like lxml beautifulsoup4 for parse the table from html file.

In [16]:
len(tables)

1

In [17]:
failures = tables[0]

In [18]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [27]:
close_time_stamp = pd.to_datetime(failures['Closing Date'])

In [28]:
close_time_stamp.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

In [30]:
path = 'G:\Data_Analysis\pydata-book-2nd-edition\datasets\mta_perf\Performance_MNR.xml'

In [31]:
parsed = objectify.parse(open(path))

In [32]:
root = parsed.getroot()

In [34]:
data = []

In [35]:
skip_fields = ['PARENT_SEQ','INDICATOR_SEQ','DESIRED_CHANGE','DECIMAL_PLACES']

In [43]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [44]:
perf = pd.DataFrame(data)

In [46]:
perf.head()

,AGENCY_NAME,CATEGORY,DESCRIPTION,FREQUENCY,INDICATOR_NAME,INDICATOR_UNIT,MONTHLY_ACTUAL,MONTHLY_TARGET,PERIOD_MONTH,PERIOD_YEAR,YTD_ACTUAL,YTD_TARGET
0,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,1,2008,96.9,95
1,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95,95,2,2008,96,95
2,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,3,2008,96.3,95
3,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,98.3,95,4,2008,96.8,95
4,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95.8,95,5,2008,96.6,95

In [1]:
from io import StringIO

In [2]:
tag = '<a href = "http://www.google.com">GOOGLE</a>'

In [6]:
root = objectify.parse(StringIO(tag)).getroot()

In [7]:
root

In [9]:
root.get('href')

'http://www.google.com'

In [11]:
root.text

'GOOGLE'

In [12]:
# BONARY DATA FORMATS :-